---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
RebarShapeConstraintArcLength Properties
RebarShapeConstraintArcLength Class See Also Send Feedback
---

The RebarShapeConstraintArcLength type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from RebarShapeConstraint.) |

# See Also

RebarShapeConstraintArcLength Class

Autodesk.Revit.DB.Structure Namespace